wzurawski015/esp8266-event-driven-framework/adapters/esp8266_rtos_sdk/targets/atnel_air_esp_motherboard_i2c_hil/main/ev_i2c_hil.c
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "driver/gpio.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_system.h"
#include "rom/ets_sys.h"

#include "ev/esp8266_i2c_hil.h"
#include "ev/esp8266_port_adapters.h"
#include "board_profile.h"

#define EV_HIL_I2C_TAG "ev_i2c_hil"
#define EV_HIL_OLED_CONTROL_CMD 0x00U
#define EV_HIL_OLED_CONTROL_DATA 0x40U
#define EV_HIL_OLED_WIDTH 72U
#define EV_HIL_OLED_PAGE_COUNT 5U
#define EV_HIL_OLED_DATA_CHUNK_BYTES 32U
#define EV_HIL_IRQ_DRAIN_LIMIT 256U
#define EV_HIL_IRQ_FLOOD_STACK_WORDS 384U
#define EV_HIL_IRQ_FLOOD_HALF_PERIOD_US 250U

#define EV_HIL_MCP23008_REG_IODIR 0x00U
#define EV_HIL_MCP23008_REG_GPIO 0x09U
#define EV_HIL_MCP23008_REG_OLAT 0x0AU

#if !defined(configSUPPORT_STATIC_ALLOCATION)
#define configSUPPORT_STATIC_ALLOCATION 0
#endif

#if !defined(INCLUDE_uxTaskGetStackHighWaterMark)
#define INCLUDE_uxTaskGetStackHighWaterMark 0
#endif

#ifndef EV_BOARD_I2C_SDA_GPIO
#define EV_BOARD_I2C_SDA_GPIO (-1)
#endif
#ifndef EV_BOARD_I2C_SCL_GPIO
#define EV_BOARD_I2C_SCL_GPIO (-1)
#endif
#ifndef EV_BOARD_ONEWIRE_GPIO
#define EV_BOARD_ONEWIRE_GPIO (-1)
#endif
#ifndef EV_BOARD_I2C_DEFAULT_SPEED_HZ
#define EV_BOARD_I2C_DEFAULT_SPEED_HZ 100000U
#endif

#if (EV_BOARD_I2C_SDA_GPIO < 0) || (EV_BOARD_I2C_SCL_GPIO < 0)
#error "ATNEL I2C HIL requires EV_BOARD_I2C_SDA_GPIO and EV_BOARD_I2C_SCL_GPIO for fault diagnostics"
#endif

typedef struct ev_hil_suite_result {
    uint32_t passed;
    uint32_t failed;
    uint32_t skipped;
} ev_hil_suite_result_t;

typedef struct ev_hil_irq_flood_ctx {
    volatile bool run;
    volatile uint32_t toggles;
    int gpio;
} ev_hil_irq_flood_ctx_t;

#if (configSUPPORT_STATIC_ALLOCATION == 1)
static StaticTask_t s_ev_hil_irq_flood_tcb;
static StackType_t s_ev_hil_irq_flood_stack[EV_HIL_IRQ_FLOOD_STACK_WORDS];
#endif
static ev_hil_irq_flood_ctx_t s_ev_hil_irq_flood_ctx;
static TaskHandle_t s_ev_hil_irq_flood_task_handle;


static void ev_hil_log_board_pin_map(const ev_esp8266_i2c_hil_config_t *cfg)
{
    ESP_LOGI(EV_HIL_I2C_TAG,
             "EV_HIL_BOARD_PIN_MAP board=%s i2c_port=%u scl_gpio=%d sda_gpio=%d onewire_gpio=%d source=bsp/atnel_air_esp_motherboard/pins.def",
             (cfg != NULL && cfg->board_tag != NULL) ? cfg->board_tag : "unknown",
             (cfg != NULL) ? (unsigned)cfg->i2c_port_num : 0U,
             EV_BOARD_I2C_SCL_GPIO,
             EV_BOARD_I2C_SDA_GPIO,
             EV_BOARD_ONEWIRE_GPIO);
    ESP_LOGI(EV_HIL_I2C_TAG,
             "EV_HIL_I2C_SPEED_POLICY default_hz=%u safe_hz=100000 fast_hz=400000 fast_requires_logic_analyzer=1",
             (unsigned)EV_BOARD_I2C_DEFAULT_SPEED_HZ);
}

static const char *ev_hil_status_name(ev_i2c_status_t status)
{
    switch (status) {
    case EV_I2C_OK:
        return "OK";
    case EV_I2C_ERR_TIMEOUT:
        return "TIMEOUT";
    case EV_I2C_ERR_NACK:
        return "NACK";
    case EV_I2C_ERR_BUS_LOCKED:
    default:
        return "BUS_LOCKED";
    }
}

static void ev_hil_pass(ev_hil_suite_result_t *result, const char *name)
{
    if (result != NULL) {
        ++result->passed;
    }
    ESP_LOGI(EV_HIL_I2C_TAG, "EV_HIL_CASE %s PASS", name);
}

static void ev_hil_fail(ev_hil_suite_result_t *result, const char *name, const char *reason)
{
    if (result != NULL) {
        ++result->failed;
    }
    ESP_LOGE(EV_HIL_I2C_TAG, "EV_HIL_CASE %s FAIL reason=%s", name, reason);
}

static void ev_hil_skip(ev_hil_suite_result_t *result, const char *name, const char *reason)
{
    if (result != NULL) {
        ++result->skipped;
    }
    ESP_LOGW(EV_HIL_I2C_TAG, "EV_HIL_CASE %s SKIP reason=%s", name, reason);
}

static bool ev_hil_gpio_is_valid(int gpio)
{
    return (gpio >= 0) && (gpio <= 15);
}

static int ev_hil_gpio_level_or_minus_one(int gpio)
{
    if (!ev_hil_gpio_is_valid(gpio)) {
        return -1;
    }
    return gpio_get_level((gpio_num_t)gpio);
}

static void ev_hil_log_fault_fixture_levels(const char *name,
                                             const char *stage,
                                             int fault_gpio,
                                             int sda_gpio,
                                             int scl_gpio)
{
    ESP_LOGI(EV_HIL_I2C_TAG,
             "fault-fixture:%s:%s fault_gpio=%d fault_level=%d sda_gpio=%d sda_level=%d scl_gpio=%d scl_level=%d",
             (name != NULL) ? name : "unknown",
             (stage != NULL) ? stage : "unknown",
             fault_gpio,
             ev_hil_gpio_level_or_minus_one(fault_gpio),
             sda_gpio,
             ev_hil_gpio_level_or_minus_one(sda_gpio),
             scl_gpio,
             ev_hil_gpio_level_or_minus_one(scl_gpio));
}

static const char *ev_hil_fault_reason_for_sda(ev_i2c_status_t stuck_status, ev_i2c_status_t recovery_status)
{
    if ((stuck_status == EV_I2C_OK) && (recovery_status == EV_I2C_OK)) {
        return "fault GPIO did not pull SDA low; check fixture coupling";
    }
    return "SDA fault was not contained or bus did not recover after release";
}

static const char *ev_hil_fault_reason_for_scl(ev_i2c_status_t stuck_status, ev_i2c_status_t recovery_status)
{
    if ((stuck_status == EV_I2C_OK) && (recovery_status == EV_I2C_OK)) {
        return "fault GPIO did not pull SCL low; check fixture coupling";
    }
    return "SCL fault did not timeout or bus did not recover after release";
}

static bool ev_hil_i2c_port_is_valid(const ev_i2c_port_t *port)
{
    return (port != NULL) && (port->ctx != NULL) && (port->write_stream != NULL) &&
           (port->read_stream != NULL) && (port->write_regs != NULL) && (port->read_regs != NULL);
}

static uint32_t ev_hil_free_heap(void)
{
    return (uint32_t)esp_get_free_heap_size();
}

static void ev_hil_heap_gate(ev_hil_suite_result_t *result, const char *name, uint32_t before_heap)
{
    const uint32_t after_heap = ev_hil_free_heap();

    ESP_LOGI(EV_HIL_I2C_TAG,
             "heap-gate: %s before=%u after=%u delta=%d",
             name,
             (unsigned)before_heap,
             (unsigned)after_heap,
             (int)after_heap - (int)before_heap);
    if (after_heap < before_heap) {
        ev_hil_fail(result, name, "heap decreased during zero-heap I2C transaction loop");
    }
}

static ev_i2c_status_t ev_hil_i2c_write_stream(const ev_esp8266_i2c_hil_config_t *cfg,
                                                uint8_t addr,
                                                const uint8_t *data,
                                                size_t data_len)
{
    return cfg->i2c_port->write_stream(cfg->i2c_port->ctx, cfg->i2c_port_num, addr, data, data_len);
}

