wzurawski015/esp8266-event-driven-framework/adapters/esp8266_rtos_sdk/targets/atnel_air_esp_motherboard_i2c_hil/main/ev_i2c_hil.c
static ev_i2c_status_t ev_hil_i2c_read_stream(const ev_esp8266_i2c_hil_config_t *cfg,
                                               uint8_t addr,
                                               uint8_t *data,
                                               size_t data_len)
{
    return cfg->i2c_port->read_stream(cfg->i2c_port->ctx, cfg->i2c_port_num, addr, data, data_len);
}

static ev_i2c_status_t ev_hil_i2c_write_regs(const ev_esp8266_i2c_hil_config_t *cfg,
                                              uint8_t addr,
                                              uint8_t reg,
                                              const uint8_t *data,
                                              size_t data_len)
{
    return cfg->i2c_port->write_regs(cfg->i2c_port->ctx, cfg->i2c_port_num, addr, reg, data, data_len);
}

static ev_i2c_status_t ev_hil_i2c_read_regs(const ev_esp8266_i2c_hil_config_t *cfg,
                                             uint8_t addr,
                                             uint8_t reg,
                                             uint8_t *data,
                                             size_t data_len)
{
    return cfg->i2c_port->read_regs(cfg->i2c_port->ctx, cfg->i2c_port_num, addr, reg, data, data_len);
}

static ev_result_t ev_hil_configure_open_drain_gpio(int gpio)
{
    gpio_config_t cfg = {0};
    esp_err_t rc;

    if (!ev_hil_gpio_is_valid(gpio)) {
        return EV_ERR_INVALID_ARG;
    }

    cfg.pin_bit_mask = (uint64_t)1ULL << (unsigned)gpio;
    cfg.mode = GPIO_MODE_OUTPUT_OD;
    cfg.pull_up_en = GPIO_PULLUP_ENABLE;
    cfg.pull_down_en = GPIO_PULLDOWN_DISABLE;
    cfg.intr_type = GPIO_INTR_DISABLE;

    rc = gpio_config(&cfg);
    if (rc != ESP_OK) {
        return EV_ERR_STATE;
    }

    gpio_set_level((gpio_num_t)gpio, 1);
    return EV_OK;
}

static void ev_hil_fault_gpio_release(int gpio)
{
    if (ev_hil_gpio_is_valid(gpio)) {
        gpio_set_level((gpio_num_t)gpio, 1);
    }
}

static void ev_hil_fault_gpio_drive_low(int gpio)
{
    if (ev_hil_gpio_is_valid(gpio)) {
        gpio_set_level((gpio_num_t)gpio, 0);
    }
}

static bool ev_hil_fault_gpio_prepare(ev_hil_suite_result_t *result, const char *name, int gpio)
{
    ev_result_t rc;

    if (!ev_hil_gpio_is_valid(gpio)) {
        ev_hil_skip(result, name, "fixture GPIO disabled");
        return false;
    }

    rc = ev_hil_configure_open_drain_gpio(gpio);
    if (rc != EV_OK) {
        ev_hil_fail(result, name, "failed to configure fault-injection GPIO");
        return false;
    }

    return true;
}

static bool ev_hil_i2c_expect_ok(ev_hil_suite_result_t *result,
                                 const char *name,
                                 ev_i2c_status_t status,
                                 uint32_t iteration)
{
    if (status == EV_I2C_OK) {
        return true;
    }

    ESP_LOGE(EV_HIL_I2C_TAG,
             "%s iteration=%u status=%s",
             name,
             (unsigned)iteration,
             ev_hil_status_name(status));
    ev_hil_fail(result, name, "unexpected I2C status");
    return false;
}

static void ev_hil_log_i2c_diag(const char *stage, ev_i2c_port_num_t port_num)
{
    ev_esp8266_i2c_diag_snapshot_t diag = {0};

    if (ev_esp8266_i2c_get_diag(port_num, &diag) == EV_OK) {
        ESP_LOGI(EV_HIL_I2C_TAG,
                 "i2c-diag:%s started=%u failed=%u nacks=%u timeouts=%u locked=%u recoveries=%u recovery_failures=%u addr_w_ack=%u addr_w_nack=%u addr_r_ack=%u addr_r_nack=%u read_bytes=%u final_nack=%u stop_ok=%u stop_fail=%u idle_ok=%u idle_fail=%u locks=%u unlocks=%u unbalanced=%u sda=%u scl=%u last_status=%s phase=%u",
                 stage,
                 (unsigned)diag.transactions_started,
                 (unsigned)diag.transactions_failed,
                 (unsigned)diag.nacks,
                 (unsigned)diag.timeouts,
                 (unsigned)diag.bus_locked,
                 (unsigned)diag.bus_recoveries,
                 (unsigned)diag.bus_recovery_failures,
                 (unsigned)diag.address_write_acks,
                 (unsigned)diag.address_write_nacks,
                 (unsigned)diag.address_read_acks,
                 (unsigned)diag.address_read_nacks,
                 (unsigned)diag.read_bytes,
                 (unsigned)diag.read_final_nack_sent,
                 (unsigned)diag.stop_ok,
                 (unsigned)diag.stop_release_fail,
                 (unsigned)diag.bus_idle_after_stop_ok,
                 (unsigned)diag.bus_idle_after_stop_fail,
                 (unsigned)diag.transaction_lock_count,
                 (unsigned)diag.transaction_unlock_count,
                 (unsigned)diag.transaction_lock_unbalanced,
                 diag.sda_high ? 1U : 0U,
                 diag.scl_high ? 1U : 0U,
                 ev_hil_status_name(diag.last_status),
                 (unsigned)diag.last_phase);
    }
}

static void ev_hil_log_i2c_completion_evidence(const char *name, ev_i2c_port_num_t port_num)
{
    ev_esp8266_i2c_diag_snapshot_t diag = {0};

    if (ev_esp8266_i2c_get_diag(port_num, &diag) == EV_OK) {
        ESP_LOGI(EV_HIL_I2C_TAG,
                 "EV_HIL_I2C_STOP_RELEASE name=%s attempted=%u ok=%u fail=%u idle_ok=%u idle_fail=%u sda=%u scl=%u last_status=%s phase=%u",
                 (name != NULL) ? name : "unknown",
                 (unsigned)diag.stop_attempted,
                 (unsigned)diag.stop_ok,
                 (unsigned)diag.stop_release_fail,
                 (unsigned)diag.bus_idle_after_stop_ok,
                 (unsigned)diag.bus_idle_after_stop_fail,
                 diag.last_sda_high_after_stop ? 1U : 0U,
                 diag.last_scl_high_after_stop ? 1U : 0U,
                 ev_hil_status_name(diag.last_status),
                 (unsigned)diag.last_phase);
        ESP_LOGI(EV_HIL_I2C_TAG,
                 "EV_HIL_I2C_MUTEX_EVIDENCE name=%s transaction_lock_count_delta=%u transaction_unlock_count_delta=%u unbalanced=%u",
                 (name != NULL) ? name : "unknown",
                 (unsigned)diag.transaction_lock_count,
                 (unsigned)diag.transaction_unlock_count,
                 (unsigned)diag.transaction_lock_unbalanced);
    }
}

static void ev_hil_log_irq_diag(const char *stage)
{
    ev_esp8266_irq_diag_snapshot_t diag = {0};

    if (ev_esp8266_irq_get_diag(&diag) == EV_OK) {
        ESP_LOGI(EV_HIL_I2C_TAG,
                 "irq-diag:%s write=%u read=%u pending=%u dropped=%u high_watermark=%u mask=0x%08X",
                 stage,
                 (unsigned)diag.write_seq,
                 (unsigned)diag.read_seq,
                 (unsigned)diag.pending_samples,
                 (unsigned)diag.dropped_samples,
                 (unsigned)diag.high_watermark,
                 (unsigned)diag.active_gpio_mask);
    }
}

static void ev_hil_test_rtc_reads(const ev_esp8266_i2c_hil_config_t *cfg, ev_hil_suite_result_t *result)
{
    const char *const name = "rtc-read-1000";
    uint32_t i;
    uint8_t rtc_regs[7] = {0};
    const uint32_t before_heap = ev_hil_free_heap();

    for (i = 0U; i < cfg->rtc_read_iterations; ++i) {
        const ev_i2c_status_t status = ev_hil_i2c_read_regs(cfg, cfg->rtc_addr_7bit, 0x00U, rtc_regs, sizeof(rtc_regs));
        if (!ev_hil_i2c_expect_ok(result, name, status, i)) {
            ev_hil_heap_gate(result, name, before_heap);
            return;
        }
    }

