wzurawski015/esp8266-event-driven-framework/adapters/esp8266_rtos_sdk/targets/atnel_air_esp_motherboard_i2c_hil/main/ev_i2c_hil.c
    ev_hil_pass(result, name);
    ev_hil_heap_gate(result, name, before_heap);
}

static void ev_hil_test_mcp_read_write(const ev_esp8266_i2c_hil_config_t *cfg, ev_hil_suite_result_t *result)
{
    const char *const name = "mcp23008-read-write-1000";
    uint8_t original_iodir = 0xFFU;
    uint8_t original_olat = 0U;
    uint8_t safe_iodir = 0xFFU;
    uint32_t i;
    const uint32_t before_heap = ev_hil_free_heap();
    ev_i2c_status_t status;

    status = ev_hil_i2c_read_regs(cfg, cfg->mcp23008_addr_7bit, EV_HIL_MCP23008_REG_IODIR, &original_iodir, 1U);
    if (!ev_hil_i2c_expect_ok(result, name, status, 0U)) {
        ev_hil_heap_gate(result, name, before_heap);
        return;
    }

    status = ev_hil_i2c_read_regs(cfg, cfg->mcp23008_addr_7bit, EV_HIL_MCP23008_REG_OLAT, &original_olat, 1U);
    if (!ev_hil_i2c_expect_ok(result, name, status, 0U)) {
        ev_hil_heap_gate(result, name, before_heap);
        return;
    }

    /* Keep all expander pins as inputs while exercising OLAT.
     * This verifies write/read I2C traffic without driving unknown external loads.
     */
    status = ev_hil_i2c_write_regs(cfg, cfg->mcp23008_addr_7bit, EV_HIL_MCP23008_REG_IODIR, &safe_iodir, 1U);
    if (!ev_hil_i2c_expect_ok(result, name, status, 0U)) {
        ev_hil_heap_gate(result, name, before_heap);
        return;
    }

    for (i = 0U; i < cfg->mcp_rw_iterations; ++i) {
        const uint8_t expected = (uint8_t)((i ^ (i >> 3U) ^ 0xA5U) & 0xFFU);
        uint8_t observed = 0U;

        status = ev_hil_i2c_write_regs(cfg, cfg->mcp23008_addr_7bit, EV_HIL_MCP23008_REG_OLAT, &expected, 1U);
        if (!ev_hil_i2c_expect_ok(result, name, status, i)) {
            break;
        }

        status = ev_hil_i2c_read_regs(cfg, cfg->mcp23008_addr_7bit, EV_HIL_MCP23008_REG_OLAT, &observed, 1U);
        if (!ev_hil_i2c_expect_ok(result, name, status, i)) {
            break;
        }

        if (observed != expected) {
            ESP_LOGE(EV_HIL_I2C_TAG,
                     "%s iteration=%u expected=0x%02X observed=0x%02X",
                     name,
                     (unsigned)i,
                     (unsigned)expected,
                     (unsigned)observed);
            ev_hil_fail(result, name, "MCP23008 OLAT read-back mismatch");
            break;
        }
    }

    status = ev_hil_i2c_write_regs(cfg, cfg->mcp23008_addr_7bit, EV_HIL_MCP23008_REG_OLAT, &original_olat, 1U);
    if (!ev_hil_i2c_expect_ok(result, name, status, cfg->mcp_rw_iterations)) {
        ev_hil_heap_gate(result, name, before_heap);
        return;
    }

    status = ev_hil_i2c_write_regs(cfg, cfg->mcp23008_addr_7bit, EV_HIL_MCP23008_REG_IODIR, &original_iodir, 1U);
    if (!ev_hil_i2c_expect_ok(result, name, status, cfg->mcp_rw_iterations)) {
        ev_hil_heap_gate(result, name, before_heap);
        return;
    }

    if (i == cfg->mcp_rw_iterations) {
        ev_hil_pass(result, name);
    }
    ev_hil_heap_gate(result, name, before_heap);
}

static ev_i2c_status_t ev_hil_oled_send_commands(const ev_esp8266_i2c_hil_config_t *cfg,
                                                  const uint8_t *commands,
                                                  size_t command_count)
{
    uint8_t tx[1U + EV_HIL_OLED_DATA_CHUNK_BYTES];
    size_t offset = 0U;

    if ((commands == NULL) && (command_count > 0U)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    tx[0] = EV_HIL_OLED_CONTROL_CMD;
    while (offset < command_count) {
        size_t chunk = command_count - offset;
        ev_i2c_status_t status;

        if (chunk > EV_HIL_OLED_DATA_CHUNK_BYTES) {
            chunk = EV_HIL_OLED_DATA_CHUNK_BYTES;
        }

        memcpy(&tx[1], &commands[offset], chunk);
        status = ev_hil_i2c_write_stream(cfg, cfg->oled_addr_7bit, tx, chunk + 1U);
        if (status != EV_I2C_OK) {
            return status;
        }
        offset += chunk;
    }

    return EV_I2C_OK;
}

static ev_i2c_status_t ev_hil_oled_send_data(const ev_esp8266_i2c_hil_config_t *cfg,
                                              const uint8_t *data,
                                              size_t data_len)
{
    uint8_t tx[1U + EV_HIL_OLED_DATA_CHUNK_BYTES];
    size_t offset = 0U;

    if ((data == NULL) && (data_len > 0U)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    tx[0] = EV_HIL_OLED_CONTROL_DATA;
    while (offset < data_len) {
        size_t chunk = data_len - offset;
        ev_i2c_status_t status;

        if (chunk > EV_HIL_OLED_DATA_CHUNK_BYTES) {
            chunk = EV_HIL_OLED_DATA_CHUNK_BYTES;
        }

        memcpy(&tx[1], &data[offset], chunk);
        status = ev_hil_i2c_write_stream(cfg, cfg->oled_addr_7bit, tx, chunk + 1U);
        if (status != EV_I2C_OK) {
            return status;
        }
        offset += chunk;
    }

    return EV_I2C_OK;
}

static ev_i2c_status_t ev_hil_oled_set_window(const ev_esp8266_i2c_hil_config_t *cfg,
                                               uint8_t page,
                                               uint8_t start_col,
                                               uint8_t end_col_exclusive)
{
    const uint8_t commands[] = {
        0x21U,
        start_col,
        (uint8_t)(end_col_exclusive - 1U),
        0x22U,
        page,
        page
    };

    return ev_hil_oled_send_commands(cfg, commands, sizeof(commands));
}

static void ev_hil_test_oled_partial_flush(const ev_esp8266_i2c_hil_config_t *cfg, ev_hil_suite_result_t *result)
{
    const char *const name = "oled-partial-flush";
    uint8_t pattern[16];
    uint32_t i;
    uint8_t j;
    const uint32_t before_heap = ev_hil_free_heap();

    for (j = 0U; j < sizeof(pattern); ++j) {
        pattern[j] = (uint8_t)((j & 1U) ? 0x55U : 0xAAU);
    }

    for (i = 0U; i < cfg->oled_partial_flushes; ++i) {
        const uint8_t page = (uint8_t)(i % EV_HIL_OLED_PAGE_COUNT);
        ev_i2c_status_t status = ev_hil_oled_set_window(cfg, page, 0U, (uint8_t)sizeof(pattern));
        if (!ev_hil_i2c_expect_ok(result, name, status, i)) {
            ev_hil_heap_gate(result, name, before_heap);
            return;
        }
        status = ev_hil_oled_send_data(cfg, pattern, sizeof(pattern));
        if (!ev_hil_i2c_expect_ok(result, name, status, i)) {
            ev_hil_heap_gate(result, name, before_heap);
            return;
        }
    }

