wzurawski015/esp8266-event-driven-framework/adapters/esp8266_rtos_sdk/targets/atnel_air_esp_motherboard_i2c_hil/main/ev_i2c_hil.c
    ev_hil_pass(result, name);
    ev_hil_heap_gate(result, name, before_heap);
}

static void ev_hil_test_oled_full_flush(const ev_esp8266_i2c_hil_config_t *cfg, ev_hil_suite_result_t *result)
{
    const char *const name = "oled-full-scene-flush";
    uint8_t chunk[EV_HIL_OLED_DATA_CHUNK_BYTES];
    uint32_t flush_index;
    const uint32_t before_heap = ev_hil_free_heap();

    for (flush_index = 0U; flush_index < cfg->oled_full_flushes; ++flush_index) {
        uint8_t page;

        for (page = 0U; page < EV_HIL_OLED_PAGE_COUNT; ++page) {
            uint8_t column = 0U;
            ev_i2c_status_t status = ev_hil_oled_set_window(cfg, page, 0U, EV_HIL_OLED_WIDTH);
            if (!ev_hil_i2c_expect_ok(result, name, status, flush_index)) {
                ev_hil_heap_gate(result, name, before_heap);
                return;
            }

            while (column < EV_HIL_OLED_WIDTH) {
                size_t chunk_len = EV_HIL_OLED_WIDTH - column;
                size_t i;

                if (chunk_len > sizeof(chunk)) {
                    chunk_len = sizeof(chunk);
                }
                for (i = 0U; i < chunk_len; ++i) {
                    chunk[i] = (uint8_t)((flush_index + page + column + i) & 0xFFU);
                }

                status = ev_hil_oled_send_data(cfg, chunk, chunk_len);
                if (!ev_hil_i2c_expect_ok(result, name, status, flush_index)) {
                    ev_hil_heap_gate(result, name, before_heap);
                    return;
                }
                column = (uint8_t)(column + (uint8_t)chunk_len);
            }
        }
    }

    ev_hil_pass(result, name);
    ev_hil_heap_gate(result, name, before_heap);
}

static void ev_hil_test_read_stream_completion(const ev_esp8266_i2c_hil_config_t *cfg, ev_hil_suite_result_t *result)
{
    const char *const name = "read-stream-completion";
    ev_esp8266_i2c_diag_snapshot_t before = {0};
    ev_esp8266_i2c_diag_snapshot_t after = {0};
    uint8_t sample = 0U;
    const uint32_t before_heap = ev_hil_free_heap();
    ev_i2c_status_t status;

    (void)ev_esp8266_i2c_get_diag(cfg->i2c_port_num, &before);
    status = ev_hil_i2c_read_stream(cfg, cfg->rtc_addr_7bit, &sample, 1U);
    (void)ev_esp8266_i2c_get_diag(cfg->i2c_port_num, &after);

    if ((status == EV_I2C_OK) && (after.address_read_acks > before.address_read_acks) &&
        (after.read_final_nack_sent > before.read_final_nack_sent) && (after.stop_ok > before.stop_ok) &&
        (after.bus_idle_after_stop_ok > before.bus_idle_after_stop_ok)) {
        ESP_LOGI(EV_HIL_I2C_TAG,
                 "EV_HIL_I2C_ACK_EVIDENCE name=%s address_read_acks=%u",
                 name,
                 (unsigned)after.address_read_acks);
        ESP_LOGI(EV_HIL_I2C_TAG,
                 "EV_HIL_I2C_FINAL_NACK_SENT name=%s count=%u",
                 name,
                 (unsigned)after.read_final_nack_sent);
        ev_hil_log_i2c_completion_evidence(name, cfg->i2c_port_num);
        ev_hil_pass(result, name);
    } else {
        ESP_LOGE(EV_HIL_I2C_TAG, "%s expected=OK actual=%s", name, ev_hil_status_name(status));
        ev_hil_log_i2c_completion_evidence(name, cfg->i2c_port_num);
        ev_hil_fail(result, name, "read_stream did not prove ACK/final-NACK/STOP release");
    }
    ev_hil_heap_gate(result, name, before_heap);
}

static void ev_hil_test_missing_device_read_nack(const ev_esp8266_i2c_hil_config_t *cfg, ev_hil_suite_result_t *result)
{
    const char *const name = "missing-device-read-nack-stop-release";
    ev_esp8266_i2c_diag_snapshot_t before = {0};
    ev_esp8266_i2c_diag_snapshot_t after = {0};
    const uint32_t before_heap = ev_hil_free_heap();
    const ev_i2c_status_t status_before = ev_esp8266_i2c_get_diag(cfg->i2c_port_num, &before);
    const ev_i2c_status_t status = ev_hil_i2c_read_stream(cfg, cfg->missing_addr_7bit, NULL, 0U);

    (void)status_before;
    (void)ev_esp8266_i2c_get_diag(cfg->i2c_port_num, &after);
    if ((status == EV_I2C_ERR_NACK) && (after.address_read_nacks > before.address_read_nacks) &&
        (after.stop_ok > before.stop_ok) && (after.bus_idle_after_stop_ok > before.bus_idle_after_stop_ok)) {
        ESP_LOGI(EV_HIL_I2C_TAG,
                 "EV_HIL_I2C_NACK_EVIDENCE name=%s address_read_nacks=%u",
                 name,
                 (unsigned)after.address_read_nacks);
        ev_hil_log_i2c_completion_evidence(name, cfg->i2c_port_num);
        ev_hil_pass(result, name);
    } else {
        ESP_LOGE(EV_HIL_I2C_TAG, "%s expected=NACK actual=%s", name, ev_hil_status_name(status));
        ev_hil_log_i2c_completion_evidence(name, cfg->i2c_port_num);
        ev_hil_fail(result, name, "read_stream NACK did not prove STOP release");
    }
    ev_hil_heap_gate(result, name, before_heap);
}

static void ev_hil_test_missing_device_nack(const ev_esp8266_i2c_hil_config_t *cfg, ev_hil_suite_result_t *result)
{
    const char *const name = "missing-device-write-nack-stop-release";
    ev_esp8266_i2c_diag_snapshot_t before = {0};
    ev_esp8266_i2c_diag_snapshot_t after = {0};
    const uint32_t before_heap = ev_hil_free_heap();
    const ev_i2c_status_t status_before = ev_esp8266_i2c_get_diag(cfg->i2c_port_num, &before);
    const ev_i2c_status_t status = ev_hil_i2c_write_stream(cfg, cfg->missing_addr_7bit, NULL, 0U);

    (void)status_before;
    (void)ev_esp8266_i2c_get_diag(cfg->i2c_port_num, &after);
    if ((status == EV_I2C_ERR_NACK) && (after.address_write_nacks > before.address_write_nacks) &&
        (after.stop_ok > before.stop_ok) && (after.bus_idle_after_stop_ok > before.bus_idle_after_stop_ok)) {
        ESP_LOGI(EV_HIL_I2C_TAG,
                 "EV_HIL_I2C_NACK_EVIDENCE name=%s address_write_nacks=%u",
                 name,
                 (unsigned)after.address_write_nacks);
        ev_hil_log_i2c_completion_evidence(name, cfg->i2c_port_num);
        ev_hil_pass(result, name);
    } else {
        ESP_LOGE(EV_HIL_I2C_TAG, "%s expected=NACK actual=%s", name, ev_hil_status_name(status));
        ev_hil_log_i2c_completion_evidence(name, cfg->i2c_port_num);
        ev_hil_fail(result, name, "write_stream NACK did not prove STOP release");
    }
    ev_hil_heap_gate(result, name, before_heap);
}

static void ev_hil_test_sda_stuck_low(const ev_esp8266_i2c_hil_config_t *cfg, ev_hil_suite_result_t *result)
{
    const char *const name = "sda-stuck-low-containment";
    ev_i2c_status_t stuck_status;
    ev_i2c_status_t recovery_status;
    const uint32_t before_heap = ev_hil_free_heap();
    int sda_before;
    int scl_before;
    int sda_during;
    int scl_during;
    int sda_after;
    int scl_after;
    bool injection_coupled;
    ev_esp8266_i2c_diag_snapshot_t before_diag = {0};
    ev_esp8266_i2c_diag_snapshot_t after_diag = {0};

    (void)ev_esp8266_i2c_get_diag(cfg->i2c_port_num, &before_diag);
    ESP_LOGI(EV_HIL_I2C_TAG, "EV_HIL_I2C_CASE_BEGIN name=%s", name);

    if (!ev_hil_fault_gpio_prepare(result, name, cfg->sda_fault_gpio)) {
        ESP_LOGE(EV_HIL_I2C_TAG, "EV_HIL_I2C_CASE_RESULT name=%s status=FAIL reason=FIXTURE_GPIO_UNAVAILABLE", name);
        return;
    }

    sda_before = ev_hil_gpio_level_or_minus_one(EV_BOARD_I2C_SDA_GPIO);
    scl_before = ev_hil_gpio_level_or_minus_one(EV_BOARD_I2C_SCL_GPIO);
    ev_hil_log_fault_fixture_levels(name, "before_fault", cfg->sda_fault_gpio, EV_BOARD_I2C_SDA_GPIO, EV_BOARD_I2C_SCL_GPIO);
    ev_hil_fault_gpio_drive_low(cfg->sda_fault_gpio);
    ets_delay_us(20U);
    sda_during = ev_hil_gpio_level_or_minus_one(EV_BOARD_I2C_SDA_GPIO);
    scl_during = ev_hil_gpio_level_or_minus_one(EV_BOARD_I2C_SCL_GPIO);
    injection_coupled = (sda_during == 0);
    ev_hil_log_fault_fixture_levels(name, "during_fault", cfg->sda_fault_gpio, EV_BOARD_I2C_SDA_GPIO, EV_BOARD_I2C_SCL_GPIO);
    ESP_LOGI(EV_HIL_I2C_TAG,
             "EV_HIL_I2C_SDA_FORCE_LOW requested=1 observed=%u fault_gpio=%d sda_gpio=%d",
             injection_coupled ? 1U : 0U,
             cfg->sda_fault_gpio,
             EV_BOARD_I2C_SDA_GPIO);
    ESP_LOGI(EV_HIL_I2C_TAG,
             "EV_HIL_I2C_BUS_STATE before=sda:%d,scl:%d during=sda:%d,scl:%d",
             sda_before,
             scl_before,
             sda_during,
             scl_during);
    stuck_status = ev_hil_i2c_write_stream(cfg, cfg->rtc_addr_7bit, NULL, 0U);
    ev_hil_fault_gpio_release(cfg->sda_fault_gpio);
    ets_delay_us(20U);
    sda_after = ev_hil_gpio_level_or_minus_one(EV_BOARD_I2C_SDA_GPIO);
    scl_after = ev_hil_gpio_level_or_minus_one(EV_BOARD_I2C_SCL_GPIO);
    ev_hil_log_fault_fixture_levels(name, "after_release", cfg->sda_fault_gpio, EV_BOARD_I2C_SDA_GPIO, EV_BOARD_I2C_SCL_GPIO);
    ESP_LOGI(EV_HIL_I2C_TAG,
             "EV_HIL_I2C_BUS_STATE after=sda:%d,scl:%d stuck_status=%s",
             sda_after,
             scl_after,
             ev_hil_status_name(stuck_status));
    ESP_LOGI(EV_HIL_I2C_TAG, "EV_HIL_I2C_RECOVERY_BEGIN name=%s", name);
    recovery_status = ev_hil_i2c_write_stream(cfg, cfg->rtc_addr_7bit, NULL, 0U);
    (void)ev_esp8266_i2c_get_diag(cfg->i2c_port_num, &after_diag);
    ESP_LOGI(EV_HIL_I2C_TAG, "EV_HIL_I2C_RECOVERY_RESULT status=%s", ev_hil_status_name(recovery_status));
    ESP_LOGI(EV_HIL_I2C_TAG,
             "EV_HIL_I2C_RECOVERY_EVIDENCE case=%s pulses=%u stop_attempted=1 sda=%d scl=%d recovery_count_delta=%u post_recovery_probe=%s",
             name,
             9U,
             sda_after,
             scl_after,
             (unsigned)(after_diag.bus_recoveries - before_diag.bus_recoveries),
             (recovery_status == EV_I2C_OK) ? "ACK" : ev_hil_status_name(recovery_status));

    if (!injection_coupled) {
        ESP_LOGE(EV_HIL_I2C_TAG, "EV_HIL_I2C_CASE_RESULT name=%s status=FAIL reason=FIXTURE_NOT_COUPLED", name);
        ev_hil_fail(result, name, "FIXTURE_NOT_COUPLED");
    } else if (((stuck_status == EV_I2C_ERR_BUS_LOCKED) || (stuck_status == EV_I2C_ERR_TIMEOUT)) &&
               (recovery_status == EV_I2C_OK)) {
        ESP_LOGI(EV_HIL_I2C_TAG, "EV_HIL_I2C_CASE_RESULT name=%s status=PASS", name);
        ev_hil_pass(result, name);
    } else {
        ESP_LOGE(EV_HIL_I2C_TAG,
                 "%s sda_fault_gpio=%d sda_bus_gpio=%d scl_bus_gpio=%d stuck_status=%s recovery_status=%s",
                 name,
                 cfg->sda_fault_gpio,
                 EV_BOARD_I2C_SDA_GPIO,
                 EV_BOARD_I2C_SCL_GPIO,
                 ev_hil_status_name(stuck_status),
                 ev_hil_status_name(recovery_status));
        ESP_LOGE(EV_HIL_I2C_TAG, "EV_HIL_I2C_CASE_RESULT name=%s status=FAIL reason=CONTAINMENT_OR_RECOVERY_FAILED", name);
        ev_hil_fail(result, name, ev_hil_fault_reason_for_sda(stuck_status, recovery_status));
    }
    ev_hil_heap_gate(result, name, before_heap);
}

