wzurawski015/esp8266-event-driven-framework/adapters/esp8266_rtos_sdk/targets/atnel_air_esp_motherboard_i2c_hil/main/ev_i2c_hil.c
static void ev_hil_test_scl_held_low_timeout(const ev_esp8266_i2c_hil_config_t *cfg, ev_hil_suite_result_t *result)
{
    const char *const name = "scl-held-low-timeout";
    ev_i2c_status_t stuck_status;
    ev_i2c_status_t recovery_status;
    const uint32_t before_heap = ev_hil_free_heap();

    if (!ev_hil_fault_gpio_prepare(result, name, cfg->scl_fault_gpio)) {
        return;
    }

    ev_hil_log_fault_fixture_levels(name, "before_fault", cfg->scl_fault_gpio, EV_BOARD_I2C_SDA_GPIO, EV_BOARD_I2C_SCL_GPIO);
    ev_hil_fault_gpio_drive_low(cfg->scl_fault_gpio);
    ets_delay_us(20U);
    ev_hil_log_fault_fixture_levels(name, "during_fault", cfg->scl_fault_gpio, EV_BOARD_I2C_SDA_GPIO, EV_BOARD_I2C_SCL_GPIO);
    stuck_status = ev_hil_i2c_write_stream(cfg, cfg->rtc_addr_7bit, NULL, 0U);
    ev_hil_fault_gpio_release(cfg->scl_fault_gpio);
    ets_delay_us(20U);
    ev_hil_log_fault_fixture_levels(name, "after_release", cfg->scl_fault_gpio, EV_BOARD_I2C_SDA_GPIO, EV_BOARD_I2C_SCL_GPIO);
    recovery_status = ev_hil_i2c_write_stream(cfg, cfg->rtc_addr_7bit, NULL, 0U);
    ESP_LOGI(EV_HIL_I2C_TAG,
             "EV_HIL_I2C_CLOCK_STRETCH_EVIDENCE case=%s max_wait_us=300 timeout_status=%s recovery_status=%s scl_held_low_case=%s",
             name,
             ev_hil_status_name(stuck_status),
             ev_hil_status_name(recovery_status),
             (stuck_status == EV_I2C_ERR_TIMEOUT) ? "PASS" : "FAIL");

    if ((stuck_status == EV_I2C_ERR_TIMEOUT) && (recovery_status == EV_I2C_OK)) {
        ev_hil_pass(result, name);
    } else {
        ESP_LOGE(EV_HIL_I2C_TAG,
                 "%s scl_fault_gpio=%d sda_bus_gpio=%d scl_bus_gpio=%d stuck_status=%s recovery_status=%s",
                 name,
                 cfg->scl_fault_gpio,
                 EV_BOARD_I2C_SDA_GPIO,
                 EV_BOARD_I2C_SCL_GPIO,
                 ev_hil_status_name(stuck_status),
                 ev_hil_status_name(recovery_status));
        ev_hil_fail(result, name, ev_hil_fault_reason_for_scl(stuck_status, recovery_status));
    }
    ev_hil_heap_gate(result, name, before_heap);
}

static uint32_t ev_hil_irq_drain(ev_irq_port_t *irq_port)
{
    uint32_t drained = 0U;

    if ((irq_port == NULL) || (irq_port->pop == NULL)) {
        return 0U;
    }

    while (drained < EV_HIL_IRQ_DRAIN_LIMIT) {
        ev_irq_sample_t sample = {0};
        ev_result_t rc = irq_port->pop(irq_port->ctx, &sample);
        if (rc == EV_ERR_EMPTY) {
            break;
        }
        if (rc != EV_OK) {
            break;
        }
        ++drained;
    }

    return drained;
}


static void ev_hil_irq_flood_log_stack(const char *task_name)
{
#if (INCLUDE_uxTaskGetStackHighWaterMark == 1)
    if (s_ev_hil_irq_flood_task_handle == NULL) {
        ESP_LOGW(EV_HIL_I2C_TAG, "EV_HIL_STACK task=%s status=not_available", (task_name != NULL) ? task_name : "irq-flood");
        return;
    }
    ESP_LOGI(EV_HIL_I2C_TAG,
             "EV_HIL_STACK task=%s high_water_words=%u",
             (task_name != NULL) ? task_name : "irq-flood",
             (unsigned)uxTaskGetStackHighWaterMark(s_ev_hil_irq_flood_task_handle));
#else
    (void)task_name;
    ESP_LOGW(EV_HIL_I2C_TAG, "EV_HIL_STACK task=irq-flood status=not_available");
#endif
}

static void ev_hil_irq_flood_task(void *arg)
{
    ev_hil_irq_flood_ctx_t *ctx = (ev_hil_irq_flood_ctx_t *)arg;
    uint8_t level = 0U;

    while ((ctx != NULL) && ctx->run) {
        gpio_set_level((gpio_num_t)ctx->gpio, level);
        level = (level == 0U) ? 1U : 0U;
        ++ctx->toggles;
        ets_delay_us(EV_HIL_IRQ_FLOOD_HALF_PERIOD_US);
    }

    if (ctx != NULL) {
        gpio_set_level((gpio_num_t)ctx->gpio, 1);
    }
    vTaskDelete(NULL);
}


static bool ev_hil_irq_flood_start(int gpio)
{
#if (configSUPPORT_STATIC_ALLOCATION == 1)
    TaskHandle_t task;

    if (ev_hil_configure_open_drain_gpio(gpio) != EV_OK) {
        return false;
    }

    memset(&s_ev_hil_irq_flood_ctx, 0, sizeof(s_ev_hil_irq_flood_ctx));
    s_ev_hil_irq_flood_ctx.gpio = gpio;
    s_ev_hil_irq_flood_ctx.run = true;

    task = xTaskCreateStatic(ev_hil_irq_flood_task,
                             "ev_hil_irq_flood",
                             EV_HIL_IRQ_FLOOD_STACK_WORDS,
                             &s_ev_hil_irq_flood_ctx,
                             tskIDLE_PRIORITY + 1U,
                             s_ev_hil_irq_flood_stack,
                             &s_ev_hil_irq_flood_tcb);
    s_ev_hil_irq_flood_task_handle = task;
    return task != NULL;
#else
    BaseType_t task_rc;

    if (ev_hil_configure_open_drain_gpio(gpio) != EV_OK) {
        return false;
    }

    memset(&s_ev_hil_irq_flood_ctx, 0, sizeof(s_ev_hil_irq_flood_ctx));
    s_ev_hil_irq_flood_ctx.gpio = gpio;
    s_ev_hil_irq_flood_ctx.run = true;

    /*
     * MISRA EXCEPTION: the ESP8266 RTOS SDK used by this HIL target may not
     * expose configSUPPORT_STATIC_ALLOCATION. Dynamic task creation is
     * permitted only during HIL bootstrap to start the auxiliary IRQ flood
     * task; the I2C runtime under test remains zero-heap.
     */
    task_rc = xTaskCreate(ev_hil_irq_flood_task,
                          "ev_hil_irq_flood",
                          EV_HIL_IRQ_FLOOD_STACK_WORDS,
                          &s_ev_hil_irq_flood_ctx,
                          tskIDLE_PRIORITY + 1U,
                          &s_ev_hil_irq_flood_task_handle);
    if (task_rc != pdPASS) {
        s_ev_hil_irq_flood_task_handle = NULL;
    }
    return task_rc == pdPASS;
#endif
}
static void ev_hil_irq_flood_stop(void)
{
    ev_hil_irq_flood_log_stack("irq-flood");
    s_ev_hil_irq_flood_ctx.run = false;
    vTaskDelay(pdMS_TO_TICKS(20U));
    s_ev_hil_irq_flood_task_handle = NULL;
}

static void ev_hil_test_irq_flood_during_i2c(const ev_esp8266_i2c_hil_config_t *cfg, ev_hil_suite_result_t *result)
{
    const char *const name = "gpio-irq-flood-during-i2c";
    ev_esp8266_irq_diag_snapshot_t before_irq = {0};
    ev_esp8266_irq_diag_snapshot_t after_irq = {0};
    uint32_t i;
    uint32_t drained = 0U;
    uint8_t rtc_regs[7] = {0};
    uint32_t before_heap = 0U;

    if ((cfg->irq_port == NULL) || (cfg->irq_port->enable == NULL) || (cfg->irq_port->pop == NULL)) {
        ev_hil_skip(result, name, "IRQ port unavailable");
        return;
    }
    if (!ev_hil_gpio_is_valid(cfg->irq_flood_output_gpio)) {
        ev_hil_skip(result, name, "IRQ flood fixture GPIO disabled");
        return;
    }
    (void)cfg->irq_port->enable(cfg->irq_port->ctx, cfg->irq_flood_line_id, true);
    (void)ev_hil_irq_drain(cfg->irq_port);
    (void)ev_esp8266_irq_get_diag(&before_irq);

    if (!ev_hil_irq_flood_start(cfg->irq_flood_output_gpio)) {
        ev_hil_fail(result, name, "failed to start IRQ flood task");
        return;
    }

    before_heap = ev_hil_free_heap();
    for (i = 0U; i < cfg->irq_flood_i2c_transactions; ++i) {
        const ev_i2c_status_t status = ev_hil_i2c_read_regs(cfg, cfg->rtc_addr_7bit, 0x00U, rtc_regs, sizeof(rtc_regs));
        if (!ev_hil_i2c_expect_ok(result, name, status, i)) {
            ev_hil_irq_flood_stop();
            ev_hil_heap_gate(result, name, before_heap);
            return;
        }
        drained += ev_hil_irq_drain(cfg->irq_port);
    }

    ev_hil_irq_flood_stop();
    drained += ev_hil_irq_drain(cfg->irq_port);
    (void)ev_esp8266_irq_get_diag(&after_irq);

    if (after_irq.dropped_samples != before_irq.dropped_samples) {
        ESP_LOGE(EV_HIL_I2C_TAG,
                 "%s dropped_before=%u dropped_after=%u drained=%u toggles=%u",
                 name,
                 (unsigned)before_irq.dropped_samples,
                 (unsigned)after_irq.dropped_samples,
                 (unsigned)drained,
                 (unsigned)s_ev_hil_irq_flood_ctx.toggles);
        ev_hil_fail(result, name, "IRQ samples dropped during I2C flood test");
    } else if (drained == 0U) {
        ev_hil_fail(result, name, "no IRQ samples observed; check flood fixture wiring");
    } else {
        ESP_LOGI(EV_HIL_I2C_TAG,
                 "%s drained=%u toggles=%u dropped_delta=0",
                 name,
                 (unsigned)drained,
                 (unsigned)s_ev_hil_irq_flood_ctx.toggles);
        ev_hil_pass(result, name);
    }
    ev_hil_heap_gate(result, name, before_heap);
}

