wzurawski015/esp8266-event-driven-framework/adapters/esp8266_rtos_sdk/targets/atnel_air_esp_motherboard_i2c_hil/main/ev_i2c_hil.c
ev_result_t ev_esp8266_i2c_zero_heap_hil_run(const ev_esp8266_i2c_hil_config_t *cfg)
{
    ev_hil_suite_result_t result = {0};

    if ((cfg == NULL) || !ev_hil_i2c_port_is_valid(cfg->i2c_port)) {
        return EV_ERR_INVALID_ARG;
    }

    ESP_LOGI(EV_HIL_I2C_TAG,
             "HIL start suite=%s board=%s rtc=0x%02X mcp=0x%02X oled=0x%02X missing=0x%02X",
             (cfg->suite_name != NULL) ? cfg->suite_name : "i2c-zero-heap",
             (cfg->board_tag != NULL) ? cfg->board_tag : "unknown",
             (unsigned)cfg->rtc_addr_7bit,
             (unsigned)cfg->mcp23008_addr_7bit,
             (unsigned)cfg->oled_addr_7bit,
             (unsigned)cfg->missing_addr_7bit);
    ev_hil_log_board_pin_map(cfg);
    ev_hil_log_i2c_diag("before", cfg->i2c_port_num);
    ev_hil_log_irq_diag("before");

    ev_hil_test_rtc_reads(cfg, &result);
    ev_hil_test_mcp_read_write(cfg, &result);
    ev_hil_test_oled_partial_flush(cfg, &result);
    ev_hil_test_oled_full_flush(cfg, &result);
    ev_hil_test_read_stream_completion(cfg, &result);
    ev_hil_test_missing_device_nack(cfg, &result);
    ev_hil_test_missing_device_read_nack(cfg, &result);
    ev_hil_test_sda_stuck_low(cfg, &result);
    ev_hil_test_scl_held_low_timeout(cfg, &result);
    ev_hil_test_irq_flood_during_i2c(cfg, &result);

    ev_hil_log_i2c_diag("after", cfg->i2c_port_num);
    ev_hil_log_irq_diag("after");
    ESP_LOGI(EV_HIL_I2C_TAG,
             "HIL summary passed=%u failed=%u skipped=%u",
             (unsigned)result.passed,
             (unsigned)result.failed,
             (unsigned)result.skipped);

    if ((result.failed == 0U) && (result.skipped == 0U)) {
        ESP_LOGI(EV_HIL_I2C_TAG, "EV_HIL_RESULT PASS failures=0 skipped=0");
        return EV_OK;
    }

    ESP_LOGE(EV_HIL_I2C_TAG,
             "EV_HIL_RESULT FAIL failures=%u skipped=%u",
             (unsigned)result.failed,
             (unsigned)result.skipped);
    return EV_ERR_STATE;
}
